Revit 2026 API
FieldValues Class
 Contains values corresponding to domain points. Each domain point may have an array of values, each corresponding to a separate "measurement" for which this value was calculated.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Analysis.FieldValues
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class FieldValues : IDisposable
Public Class FieldValues
	Implements IDisposable
public ref class FieldValues : IDisposable
type FieldValues =
    class
        interface IDisposable
    end
The FieldValues type exposes the following members.
Constructors
Name | Description
FieldValues(FieldValues) |  Creates a copy of the given FieldValues instance.
FieldValues(IList<ValueAtPoint>) | Initializes a new instance of the FieldValues class
FieldValues(IList<VectorAtPoint>) | Initializes a new instance of the FieldValues class
FieldValues(IList<ValueAtPoint>, XYZ) | Initializes a new instance of the FieldValues class
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the FieldValues
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace